/*********************************Copyright (c)*********************************
**--------------File Info-------------------------------------------------------
** File Name:               sim_i2c.h
** Last modified Date:      
** Last Version:            
** Description:             i2c配置文件
******************************************************************************/


#ifndef _SIM_I2C_H_
#define _SIM_I2C_H_


/******************************************************************************
********************************* 文件引用部分 ********************************
******************************************************************************/
#include "stm32f10x.h"
#include <stdbool.h>

/******************************************************************************
********************************** 需自定义 ***********************************
****************************** 参数配置、引脚定义  ****************************
******************************************************************************/

/***** 操作宏定义 *****/
#define SCL_H         (GPIOB->BSRR = GPIO_Pin_6)
#define SCL_L         (GPIOB->BRR  = GPIO_Pin_6)    
#define SDA_H         (GPIOB->BSRR = GPIO_Pin_7)
#define SDA_L         (GPIOB->BRR  = GPIO_Pin_7)
#define SCL_read      (GPIOB->IDR  & GPIO_Pin_6)
#define SDA_read      (GPIOB->IDR  & GPIO_Pin_7)


/******************************************************************************
******************************* 自定义参数配置 ********************************
******************************************************************************/
//none
#define I2C_DELAY_VAL  15    //30对应100K,经测试最低到4还能写,取值[7..255]
                             //4对应400K                                                     
/******************************************************************************
********************************* 函 数 声 明 *********************************
******************************************************************************/

//I2C完整读写函数
 void    I2C2_Config(void);          //配置I2C接口
 bool    Single_Write(u8 SlaveAddress,u8 REG_Address,u8 REG_data);
 u8      Single_Read(u8 SlaveAddress,u8 REG_Address);
 bool    Fast_Write(u8 SlaveAddress,u8 REG_Address,u8 REG_data);
 bool    Mult_Read(u8 SlaveAddress,u8 REG_Address,u8 * ptChar,u8 size);

//I2C分立操作函数
 bool I2C_Start(void);              //总线忙活或出错则返回false
 void I2C_Stop(void);
 void I2C_Ack(void);
 void I2C_NoAck(void);
 bool I2C_WaitAck(void); 	        //返回为:=1有ACK,=0无ACK
 void I2C_SendByte(u8 SendByte);    //数据从高位到低位
 u8   I2C_RadeByte(void);           //数据从高位到低位

 
/***********************************   END  ************************************/


#endif



